Сумма отрицательных элементов между минимальным и максимальным значениями массива

Описание

Этот Python-скрипт предназначен для вычисления суммы отрицательных элементов массива, расположенных между его минимальным и максимальным значением.

Алгоритм работы

Определяются индексы минимального (min_index) и максимального (max_index) элементов массива.

Проверяется порядок индексов (если min_index больше max_index, их значения меняются местами).

Производится суммирование всех отрицательных элементов, находящихся между минимальным и максимальным элементами массива.

Возвращается полученная сумма.

Код программы

def sum_negative_between_min_max(arr):
    if not arr or len(arr) < 2:
        return 0  # Если массив пуст или состоит из одного элемента, возвращаем 0

    min_index = arr.index(min(arr))
    max_index = arr.index(max(arr))

    if min_index > max_index:
        min_index, max_index = max_index, min_index  # Обеспечиваем правильный порядок

    return sum(x for x in arr[min_index + 1:max_index] if x < 0)

# Пример использования
A = [3, -1, -4, 2, -5, 7, -2, 8]
result = sum_negative_between_min_max(A)
print("Сумма отрицательных элементов между минимальным и максимальным значением:", result)

Примеры работы

Входные данные:

A = [3, -1, -4, 2, -5, 7, -2, 8]

Выходные данные:

Сумма отрицательных элементов между минимальным и максимальным значением: -5

Инструкция по запуску

Сохраните код в файл main.py.

Откройте терминал или командную строку и выполните команду:

python main.py

Репозиторий GitHub

Ссылка на репозиторий: [укажите ссылку здесь]



